import { Container } from '@mui/material';
import { Text, Wrapper } from './styles';

export default function Offices() {
  return (
    <Wrapper>
      <Container>
        <Text component="p">
          Офис Booking.com B.V. расположен в Амстердаме, Нидерланды, а 198 офисов вспомогательных компаний находятся более чем в 70 странах: Аккра - Амман - Амстердам - Анталия - Атланта - Афины - Бангалор - Бангкок - Барселона - Берлин - Бильбао - Богота - Больцано - Бордо - Бостон - Братислава - Брисбен - Брюссель - Будапешт - Бухарест - Буэнос-Айрес - Ванкувер - Варшава - Вашингтон - Вена - Венеция - Верона - Вильнюс - Гамбург - Гвадалахара - Гонконг - Гонолулу - Гранд-Рапидс - Гуанчжоу - Даллас - Денвер - Джидда - Джокьякарта - Дубай - Дублин - Дубровник - Дюссельдорф - Загреб - Зальцбург - Измир - Инсбрук - Ираклион - Йоханнесбург - Каир - Калгари - Канкун - Касабланка - Катания - Кейптаун - Кембридж - Киев - Коломбо - Копенгаген - Ко-Самуй - Краков - Куала-Лумпур - Кута (Бали) - Ларнака - Лас-Вегас - Лас-Пальмас-де-Гран-Канария - Лилль - Лима - Лимасол - Лион - Лиссабон - Лоле (Португалия) - Лондон - Любляна - Мадрид - Майами - Малага - Манила - Манчестер - Марракеш - Мельбурн - Мехико - Милан - Монпелье - Монреаль - Москва - Мумбаи - Мюнхен - Найроби - Натал - Наха - Новый Орлеан - Нью-Дели - Нью-Йорк - Окленд - Орландо - Осака - Осло - Панама - Пальма-де-Майорка - Париж - Пекин - Порту-Алегри - Прага - Пхукет - Рейкьявик - Ренн - Рига - Рим - Римини - Рио-де-Жанейро - Салланш - Салоники - Сан-Диего - Сан-Паулу - Санто-Доминго - Сан-Франциско - Сан-Хуан - Санкт-Петербург - Сантьяго - Сан-Хосе - Саппоро - Севилья - Сеул - Сиань - Сидней - Сингапур - Сиэтл - Сорренто - София - Сочи - Сплит - Стамбул - Стокгольм - Страсбург - Тайбэй - Таллин - Тбилиси - Тель-Авив - Токио - Торонто - Трабзон - Фару - Финикс - Флоренция - Фрайбург-им-Брайсгау - Франкфурт-на-Майне - Фукуока - Хайкоу - Ханой - Хельсинки - Хошимин - Хьюстон - Циндао - Цюрих - Чеджу - Чикаго - Чэнду - Шанхай - Эдинбург - Янгон..
        </Text>
        <Text component="p">
          Компания Booking.com B.V. зарегистрирована в торговом реестре Коммерческой Палаты Амстердама, Нидерланды, под номером 31047344. Регистрационный номер НДС - NL805734958B01. Регистрационный номер Ведомства Нидерландов по защите информации - 1288246.
        </Text>
      </Container>
    </Wrapper>
  );
}
